app/views/pages/_list.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
---
			<%= f.hidden_field :list_id, value: list.id %>
			<%= f.select :priority, 1..(list.tasks.count + 1), class: "combo_box" %>