app/views/pages/_task.html.erb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  ORDER BY "tasks"."priority" ASC  [["list_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
---
		<td class="list_check_box"><%= f.check_box :status %></td>
		<% if @edit_flag && Task.find(@edit_flag) == task %>
			<td><%#= f.select :priority, 1..(List.find task.list_id).tasks.count, value: task.priority %>