app/views/pages/queries.html.erb

		<ul>
			<% Task.all.select{ |t| List.find(t.list_id).user_id == current_user.id }.select{|t| t.status }.sort{|x, y| x.name <=> y.name}.each do |task| %>
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."name" = $2 LIMIT 1  [["user_id", 1], ["name", "Garage"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 3]]

			<% counts = [] %>
			<% current_user.lists.each do |list| %>
				<% hash[list.name] = list.tasks.count %>
---
SELECT "lists".* FROM "lists"
SELECT "tasks".* FROM "tasks"
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]