app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1234"], ["user_id", 1], ["created_at", "2016-02-21 16:29:05.044607"], ["updated_at", "2016-02-21 16:29:05.044607"]]
---
  def create
  	@list = current_user.lists.new params.require(:list).permit(:name)
  	if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]
---
  def destroy
  	list = List.find params[:id]
  	for task in list.tasks do
  	  	task.destroy
  	end
  	list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "fdkjgldfkjb';ksj'b;jf;bdfnis"], ["updated_at", "2016-02-25 15:00:04.885971"], ["id", 5]]
---
  def update
    @list = List.find params[:id]
    @list.update params.require(:list).permit(:name)