app/controllers/tasks_controller.rb

  def create
  	@task = Task.new params.require(:task).permit(:priority, :name, :deadline, :list_id)
    higher_tasks = (List.find @task.list_id).tasks.select { |task| task.priority >= @task.priority }.sort { |task1, task2| task1.priority <=> task2.priority }.reverse
    for task in higher_tasks do
      task.priority += 1
      task.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
INSERT INTO "tasks" ("priority", "name", "list_id", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["priority", 1], ["name", "sfghdfhg"], ["list_id", 2], ["deadline", "2016-02-21 17:26:00.000000"], ["created_at", "2016-02-21 17:27:25.194313"], ["updated_at", "2016-02-21 17:27:25.194313"]]
UPDATE "tasks" SET "priority" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["priority", 2], ["updated_at", "2016-02-22 13:28:25.727331"], ["id", 1]]

  def destroy
  	@task = Task.find params[:id]
    temp_priority = @task.priority
  	@task.destroy
    higher_tasks = (List.find @task.list_id).tasks.select { |task| task.priority >= @task.priority }.sort { |task1, task2| task1.priority <=> task2.priority }
    for task in higher_tasks do
      task.priority -= 1
      task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 9]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
UPDATE "tasks" SET "priority" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["priority", 7], ["updated_at", "2016-02-22 23:31:26.391893"], ["id", 16]]

  def update
    @task = Task.find params[:id]
    @task.update params.require(:task).permit(:status, :name, :deadline)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "status" = $1, "name" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["status", "t"], ["name", "do hometask"], ["updated_at", "2016-02-25 13:20:52.383557"], ["id", 3]]